bitbank2/CH32V003_Sensor_Platform/User/main.c
//
// Portable Sensor Platform
// by Larry Bank
//
// A CH32V003 project to allow easy field-testing of various I2C sensors
// The FLASH memory (16K) doesn't allow too many sensors + display routines to be included
// but the ones supported are auto-detected and use a nice large font to display the information
//
//#define USE_IMU
#define USE_RTC
//#define USE_BATT
//#define USE_GPS

#include "debug.h"
#include "Arduino.h"
#include "sharp_lcd.h"
#include "ltr390.h"
#include "Roboto_Black_40.h"
#include "scd41.h"
#include "rtc_eeprom.h"
#ifdef USE_IMU
#include "LSM6DS3.h"
#endif // USE_IMU
//#include "battery.h"
#include "ch32v00x_adc.h"
#include "isbic.h"
#include "psp_logo.h"

struct tm myTime;

// Hardware connections. The hex value represents the port (upper nibble) and GPIO pin (lower nibble)
// QFN20 PCB
//#define LCD_CS 0xd3
//#define LCD_VCOM 0xd4
// TSSOP20 PCB
#define LCD_CS 0xc7
#define LCD_VCOM 0xd3

#define LED_PIN 0xd6
#define SDA_PIN 0xc1
#define SCL_PIN 0xc2
#define BUTTON0_PIN 0xc3
#define BUTTON1_PIN 0xd5

int iSensor;
uint8_t bInvert = 0; // invert the LCD colors
extern uint32_t _iUV;

const char *szSensorNames[] = {"Unknown", "LTR390", "SCD4x", "LSM6DS3", "RV3032", "DS3231"};

enum {
	SENSOR_UNKNOWN,
	SENSOR_LTR390,
	SENSOR_SCD4X,
	SENSOR_LSM6DS3,
	SENSOR_RV3032,
	SENSOR_DS3231,
	SENSOR_COUNT
};

int GetButtons(void)
{
        int i = 0;
//      pinMode(BUTTON0_PIN, INPUT_PULLUP); // re-enable gpio in case it got disabled by standby mode
//      pinMode(BUTTON1_PIN, INPUT_PULLUP);
        if (digitalRead(BUTTON0_PIN) == 0) i|=1;
        if (digitalRead(BUTTON1_PIN) == 0) i|=2;
        return i;

} /* GetButtons() */

// Convert a number into a zero-terminated string
int i2str(char *pDest, int iVal)
{
        char *d = pDest;
        int i, iPlaceVal = 10000;
        int iDigits = 0;

        if (iVal < 0) {
                iDigits++;
                *d++ = '-';
                iVal = -iVal;
        }
        while (iPlaceVal) {
                if (iVal >= iPlaceVal) {
                        i = iVal / iPlaceVal;
                        *d++ = '0' + (char)i;
                        iVal -= (i*iPlaceVal);
                        iDigits++;
                } else if (iDigits != 0) {
                        *d++ = '0'; // non-zeros were already displayed
                }
                iPlaceVal /= 10;
        }
        if (d == pDest) // must be zero
                *d++ = '0';
        *d++ = 0; // terminator
        return (int)(d - pDest - 1); // string length
} /* i2str() */

// Convert a number into a zero-terminated string
void i2strf(char *pDest, int iVal, int iDigits)
{
        char *d = pDest;
        int i;
        pDest[iDigits] = 0;
        while (iDigits) {
        	iDigits--;
            i = iVal % 10;
            d[iDigits] = '0' + (char)i;
            iVal /= 10;
        }
} /* i2strf() */

#ifdef USE_GPS
#define UART_TIMEOUT 10000
//
// Returns an 8-bit character (0-255)
// or -1 to indicate a timeout
//
int UART_Read(void)
{
uint8_t c;
int iTimeout = 0;

    while(USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == RESET && iTimeout < UART_TIMEOUT)
    {
        iTimeout++;
    }
    if (iTimeout >= UART_TIMEOUT)
        return -1;
    c = (USART_ReceiveData(USART1));
    return c;
} /* UART_Read() */
//
// Parse a zero-padded number (fixed length)
// from a string
int ParseInt(char *pString, int iLen)
{
int j, i = 0;
	for (j=0; j<iLen; j++) {
		i *= 10;
		if (pString[j] < '0' || pString[j] > '9') return -1; // invalid
		i += (pString[j] - '0');
	}
	return i;
} /* ParseInt() */
//
// Parse the $GNRMC string
//
int ParseGPSPos(char *pString, char *szLAT, char *szLONG)
{
int i;

    if (pString[7] < '0' || pString[7] > '9') return 0; // invalid
    i = ParseInt(&pString[7], 2); // get hours
    if (i < 0 || i > 23) return 0; // invalid
    if (pString[18] == 'A') { // position info is valid
    	memcpy(szLAT, &pString[20], 12);
    	szLAT[12] = 0;
    	memcpy(szLONG, &pString[33], 13);
    	szLONG[13] = 0;
    	return 1;
    }
    return 0;
} /* ParseGPSPos() */

//
// Parse a $GNZDA GPS time/date string and
// set our RTC with the info if it's valid
// returns 0 for invalid string, 1 for valid time, 2 for valid time+date
//
int ParseGPSTime(char *pTime, struct tm *pTM)
{
int i;

	if (memcmp(pTime, "$GNZDA", 6) == 0) { // start of time string
		if (pTime[7] < '0' || pTime[7] > '9')
			return 0; // invalid
		i = ParseInt(&pTime[7], 2); // get hours
		if (i < 0 || i > 23)
			return 0; // neither time nor date is valid
		pTM->tm_hour = i;
		pTM->tm_min = ParseInt(&pTime[9], 2); // get minutes
		pTM->tm_sec = ParseInt(&pTime[11], 2); // get seconds
		i = ParseInt(&pTime[18], 2); // get month day
		if (i < 1 || i > 31)
			return 1; // only time is valid
		pTM->tm_mday = i; // get month day
		pTM->tm_mon = ParseInt(&pTime[21], 2) - 1; // get month (fix for 0-11)
		pTM->tm_year = ParseInt(&pTime[24], 4) - 1900; // get year
		return 2; // both time and date are valid
	}
	return 0;
} /* ParseGPSTime() */
//
// Acquire the correct time and date
// from an external GPS module
//
int GPSTime(void)
{
char szTemp[128];
char szLAT[16], szLONG[16];
int i, iLen = 0;
int iCount = 0;
int bHaveTime = 0;
struct tm myTime;

//	pinMode(LED_PIN, OUTPUT); // Show GPS is in use with LED blinking for data reception
//    UART_Init(9600);
	sharpFill(0);
	sharpWriteString(2,0, "GPS Parser", FONT_12x16, 0);
	sharpWriteBuffer();
	while (GetButtons() != 0) {}; // wait for user to release the button that got us here

    while (1) {
    	i = UART_Read();
    	if (i != -1) {
    		digitalWrite(LED_PIN, 1);
    		if (i == 0xa) {
    			digitalWrite(LED_PIN, 0);
    			szTemp[iLen] = 0;
    			if (memcmp(szTemp, "$GNRMC", 6) == 0) {
    				i = ParseGPSPos(szTemp, szLAT, szLONG);
    				if (i >= 1) {
     				   sharpWriteString(2, 48, "LAT ", FONT_8x8, 0);
     				   sharpWriteString(-1, -1, szLAT, FONT_8x8, 0);
     				   sharpWriteString(2, 56, "LON ", FONT_8x8, 0);
     				   sharpWriteString(-1, -1, szLONG, FONT_8x8, 0);
     				   sharpWriteBuffer();
    				} else { // show the string that isn't valid yet
    					sharpWriteString(2, 56, szTemp, FONT_6x8, 0);
    					sharpWriteBuffer();
    				}
    			} // Position string
    			if (memcmp(szTemp, "$GNZDA", 6) == 0) {
    			   i = ParseGPSTime(szTemp, &myTime);
    			   if (i >= 1) { // time is valid
    				   bHaveTime = 1;
    				   sharpWriteString(2,16,"Time ", FONT_12x16, 0);
    				   i2strf(szTemp, myTime.tm_hour, 2);
    				   szTemp[2] = ':';
    				   i2strf(&szTemp[3], myTime.tm_min, 2);
    				   szTemp[5] = ':';
    				   i2strf(&szTemp[6], myTime.tm_sec, 2);
    				   sharpWriteString(-1, -1, szTemp, FONT_12x16, 0);
    				   sharpWriteBuffer();

