bitbank2/CH32V003_Sensor_Platform/User/main.c
    			   if (i == 2) { // date is also valid
    				   sharpWriteString(2,32,"Date ", FONT_12x16, 0);
    				   i2strf(szTemp, myTime.tm_mday, 2);
    				   szTemp[2] = '/';
    				   i = myTime.tm_mon+1;
    				   i2strf(&szTemp[3], i, 2);
    				   szTemp[5] = '/';
    				   i = myTime.tm_year % 100;
    				   i2strf(&szTemp[6], i, 2);
    				   sharpWriteString(-1, -1, szTemp, FONT_12x16, 0);
    				   sharpWriteBuffer();
//    				   rtcSetTime(&myTime);
//    				   while (GetButtons() == 0) {};
//    				   UART_DeInit();
//    				   return 1;
    			   }
    			}
    			} // string ended with 0x0A
    			if (bHaveTime == 0) {
    				iCount++;
    				sharpWriteString(2,32, szTemp, FONT_6x8, 0);
    				sharpWriteString(2,16,"Searching ", FONT_12x16, 0);
    				i2str(szTemp, iCount);
//    				sharpWriteString(-1, 16, szTemp, FONT_12x16, 0);
    				sharpWriteBuffer();
    			}
    			iLen = 0;
    		} else if (i >= ' ' && iLen < sizeof(szTemp)-1) {
    			szTemp[iLen++] = (char)i;
    		}
    	} else {
    	} // got a character
    } // while (1)
} /* GPSTime() */

void RunGPS(void)
{
	GPSTime();
} /* RunGPS() */

void USARTInit(uint32_t baudrate)
{
    GPIO_InitTypeDef  GPIO_InitStructure;
    USART_InitTypeDef USART_InitStructure;

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC | RCC_APB2Periph_USART1, ENABLE);
// Remap USART1 to PC0/PC1
    RCC->APB2PCENR |= RCC_AFIOEN;
    AFIO->PCFR1 |= (1<<21) | (1<<2); // set both remap bits for TX=PC0, RX=PC1

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    USART_InitStructure.USART_BaudRate = baudrate;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx;

    USART_Init(USART1, &USART_InitStructure);
    USART_Cmd(USART1, ENABLE);
} /* USARTInit() */
#endif // USE_GPS

#ifdef USE_BATT
void ADCInit(void)
{
    ADC_InitTypeDef  ADC_InitStructure = {0};
    GPIO_InitTypeDef GPIO_InitStructure = {0};

    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, ENABLE);
    RCC_ADCCLKConfig(RCC_PCLK2_Div8);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4; // C4
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
    GPIO_Init(GPIOC, &GPIO_InitStructure);

    ADC_DeInit(ADC1);
    ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
    ADC_InitStructure.ADC_ScanConvMode = DISABLE;
    ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
    ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
    ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
    ADC_InitStructure.ADC_NbrOfChannel = 1;
    ADC_Init(ADC1, &ADC_InitStructure);

    ADC_Cmd(ADC1, ENABLE);
//    ADC_BufferCmd(ADC1, DISABLE); //disable buffer

    ADC_ResetCalibration(ADC1);
    while(ADC_GetResetCalibrationStatus(ADC1));
    ADC_StartCalibration(ADC1);
    while(ADC_GetCalibrationStatus(ADC1));

} /* ADCInit() */

uint16_t ADCGetValue(void)
{
    u16 val;
    u8 ch = 6;

    ADC_RegularChannelConfig(ADC1, ch, 2, ADC_SampleTime_43Cycles);
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);

    while(!ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC));

    val = ADC_GetConversionValue(ADC1);

    return val;
} /* ADCGetValue() */

void ShowBattery(int x, int y)
{
	int iBatt;
	uint8_t *s;

    ADCInit();
	iBatt = ADCGetValue();
    ADC_DeInit(ADC1);
    ADC_Cmd(ADC1, DISABLE);
	if (iBatt > 2000 && iBatt <2600) { // valid values, otherwise no battery measurement
		if (iBatt <= 2216) s = (uint8_t *)batt0_32x16; // <= 3.6v
		else if (iBatt < 2345) s = (uint8_t *)batt25_32x16; // <= 3.8v
		else if (iBatt < 2410) s = (uint8_t *)batt50_32x16; // <= 3.9v
		else if (iBatt < 2466) s = (uint8_t *)batt75_32x16; // <= 4.0v
		else s = (uint8_t *)batt100_32x16;
		sharpDrawSprite(x, y, 32, 16, s, 4, 0);
	}
} /* ShowBattery() */
#endif // USE_BATT

#ifdef USE_RTC
void SetTime(void)
{
	int i, iFlash, iCount = 0, iTick = 0, iCursor = 0, bDone = 0;
	int iButts, iOldButts = 0;
	char szTemp[16];
	struct tm myTime;

	rtcGetTime(&myTime);

	while (!bDone) {
		iFlash = ((iTick & 15) > 3);
		sharpFill(bInvert);
		sharpWriteString(128,2,"Next", FONT_8x8, bInvert);
		sharpWriteString(152,58, "+", FONT_8x8, bInvert);
		sharpWriteString(16,2, "Set Time", FONT_12x16, bInvert);
	    i2strf(szTemp, myTime.tm_mday, 2);
	    if (iCursor != 0 || (iCursor == 0 && iFlash))
           sharpWriteString(0, 18, szTemp, FONT_12x16, bInvert);
	    sharpWriteString(24, 18, "/", FONT_12x16, bInvert);

	    i = myTime.tm_mon+1;
	    i2strf(szTemp, i, 2);
	    if (iCursor != 1 || (iCursor == 1 && iFlash))
           sharpWriteString(36, 18, szTemp, FONT_12x16, bInvert);
	    sharpWriteString(60, 18, "/", FONT_12x16, bInvert);

	    i = myTime.tm_year % 100;
	    i2strf(szTemp, i+2000, 2);
	    if (iCursor != 2 || (iCursor == 2 && iFlash))
           sharpWriteString(72, 18, szTemp, FONT_12x16, bInvert);

	    i2strf(szTemp, myTime.tm_hour, 2);
	    szTemp[2] = ':';
	    szTemp[3] = 0;
	    if (iCursor != 3 || (iCursor == 3 && iFlash))
           sharpWriteString(2, 34, szTemp, FONT_12x16, bInvert);
	    i2strf(szTemp, myTime.tm_min, 2);
	    szTemp[2] = ':';
	    szTemp[3] = 0;
	    if (iCursor != 4 || (iCursor == 4 && iFlash))
           sharpWriteString(38, 34, szTemp, FONT_12x16, bInvert);
	    i2strf(szTemp, myTime.tm_sec, 2);
	    if (iCursor != 5 || (iCursor == 5 && iFlash))
           sharpWriteString(74, 34, szTemp, FONT_12x16, bInvert);
	    // Check for user actions
	    iButts = GetButtons();
	    if (iButts == 0) iCount = 0; // reset "button held" counter
	    if (iButts == 3) { // user wants to exit without setting the time
	    	bDone = 1;
	    }
	    if (iCursor != 6 || (iCursor == 6 && iFlash))
	    	sharpWriteString(56, 50, "Done", FONT_12x16, bInvert);
	    if (iOldButts == 0 && iButts == 1) { // advance cursor
	    	iCursor++;
	    	if (iCursor > 6) iCursor = 0;
	    }
	    if (iButts == 2) {
	    	iCount++;
	    }
	    if (iCount == 1 || iCount > 24) { // adjust current (flashing) value
	    	switch (iCursor) {
	    	case 0: // day of the month
	    		myTime.tm_mday++;
	    		if (myTime.tm_mday > 31) myTime.tm_mday = 0;
	    		break;
	    	case 1: // month
	    		myTime.tm_mon++;
	    		if (myTime.tm_mon > 11) myTime.tm_mon = 0;
	    		break;
	    	case 2: // year
	    		myTime.tm_year++;
	    		myTime.tm_year = (myTime.tm_year % 100) + 100;
	    		break;
	    	case 3: // hour
	    		myTime.tm_hour++;
	    		if (myTime.tm_hour > 23) myTime.tm_hour = 0;
	    		break;
	    	case 4: // minute
	    		myTime.tm_min++;
	    		if (myTime.tm_min > 59) myTime.tm_min = 0;
	    		break;
	    	case 5: // second
	    		myTime.tm_sec++;
	    		if (myTime.tm_sec > 59) myTime.tm_sec = 0;
	    		break;
	    	case 6:
	    		// set the time and leave
	    		rtcSetTime(&myTime);
	    		sharpFill(bInvert);
	            sharpWriteBuffer();
	    		return;
	    	}
	    }
	    iOldButts = iButts;
        sharpWriteBuffer();
        Delay_Ms(33);
        iTick++;
        if ((iTick & 31) == 31) {
        	// advance the time
        	myTime.tm_sec++;
        	if (myTime.tm_sec == 60) {
        		myTime.tm_sec = 0;
        		myTime.tm_min++;
        		if (myTime.tm_min == 60) {
        			myTime.tm_min = 0;
        			myTime.tm_hour++;
        			if (myTime.tm_hour == 24) {
        				myTime.tm_hour = 0;
        			}
        		}
        	}
        }
	} // while !bDone
} /* SetTime() */

void ShowTime(void)
{
char szTemp[16];

	sharpFill(bInvert);
	sharpWriteString(136, 2, "Set", FONT_8x8, bInvert);
	sharpWriteString(112, 58, "Invert", FONT_8x8, bInvert);
	rtcGetTime(&myTime);
   	i2strf(szTemp, myTime.tm_hour, 2);
   	szTemp[2] = ':';
   	i2strf(&szTemp[3], myTime.tm_min, 2);
   	sharpWriteStringCustom(&Roboto_Black_40, 2, 32, szTemp, !bInvert, 1);
   	i2strf(szTemp, myTime.tm_sec, 2);
   	sharpWriteString(112, 14, szTemp, FONT_12x16, bInvert);
   	i2strf(szTemp, myTime.tm_mday, 2);
   	szTemp[2] = '/';
   	i2strf(&szTemp[3], myTime.tm_mon+1, 2);
   	szTemp[5] = '/';
   	i2strf(&szTemp[6], myTime.tm_year + 1900, 4);
   	sharpWriteString(2, 36, szTemp, FONT_12x16, bInvert);
  // 	ShowBattery(2, 52);
   	sharpWriteBuffer();
} /* ShowTime() */
#endif // USE_RTC

void ShowLTR390Sample(int iValue, int iMax)
{
int iUVI;
char szTemp[16];
int i;

    sharpFill(bInvert);
	sharpWriteString(24, 6, "UVI   Max", FONT_12x16, bInvert);
	iUVI = ltr390_getUVI(iValue); // instaneous value
	i2str(szTemp, iUVI/10); // whole part
    sharpWriteStringCustom(&Roboto_Black_40, 0, 62, szTemp, !bInvert, 0);
    sharpWriteStringCustom(&Roboto_Black_40, -1, 62, ".", !bInvert, 0);
	i = iUVI % 10; // 10ths
	i2str(szTemp, i);
    sharpWriteStringCustom(&Roboto_Black_40, -1, 62, szTemp, !bInvert, 0);

	iUVI = ltr390_getUVI(iMax); // max value from the last 3.2 seconds
	i2str(szTemp, iUVI/10); // whole part
    sharpWriteStringCustom(&Roboto_Black_40, 84, 62, szTemp, !bInvert, 0);
    sharpWriteStringCustom(&Roboto_Black_40, -1, 62, ".", !bInvert, 0);
	i = iUVI % 10; // 10ths
	i2str(szTemp, i);
    sharpWriteStringCustom(&Roboto_Black_40, -1, 62, szTemp, !bInvert, 0);
// DEBUG
//    i2str(szTemp, iValue);
//	sharpWriteString(2, 22, szTemp, FONT_8x8, 0);

	sharpWriteBuffer();
} /* ShowLTR390Sample() */

void i2hex(char *pStr, int i)
{
	char c;
	c = (i >> 4);
	if (c > 9) c += 55;
	else c += 48;
	pStr[0] = c;
	c = i & 0xf;
	if (c > 9)  c += 55;
	else c += 48;
	pStr[1] = c;
	pStr[2] = 0;
} /* i2hex() */

