bitbank2/CH32V003_Sensor_Platform/User/main.c
int GetSensorType(int i, char *szName)
{
uint8_t cTemp[4];
int iType = SENSOR_UNKNOWN;

	if (i == 0x53) // could be Lite-On LTR390 UV light sensor
	{
		I2CReadRegister(i, 0x06, cTemp, 1); // Part ID
		if (cTemp[0] == 0xb2) // a match!
			iType = SENSOR_LTR390;
	}
    if (i == 0x62 && iType == SENSOR_UNKNOWN) {
	    // DEBUG - for now, assume it's the SCD4x
	   iType = SENSOR_SCD4X;
    }
    if (i == 0x68 && iType == SENSOR_UNKNOWN) { // look for DS3231
        // Make sure it's really a DS3231 because other I2C devices
        // use the same address (0x68)
         I2CReadRegister(i, 0x12, cTemp, 1); // read temp reg
         if ((cTemp[0] & 0x3f) == 0) {
            iType = SENSOR_DS3231;
         }
    }
    if (iType == SENSOR_UNKNOWN && i == 0x51) {
       // The PCF8563 and RV3032 use the same I2C address (0x51)
       // Try to write to the temperature threshold register to see
       // which one is connected
       cTemp[0] = 0x17; // temp threshold high register
       cTemp[1] = 0x55; // random value to write
       I2CWrite(i, cTemp, 2);
       I2CReadRegister(i, 0x17, cTemp, 1);
       if (cTemp[0] == 0x55) {
          iType = SENSOR_RV3032;
       } // else it must be the PCF8563
    }
    if (iType == SENSOR_UNKNOWN) {
    // Check for LSM6DS3
    	I2CReadRegister(i, 0x0f, cTemp, 1); // WHO_AM_I
    	if (cTemp[0] == 0x69) {
    		iType = SENSOR_LSM6DS3;
    	}
    }

    strcpy(szName, szSensorNames[iType]);
	return iType;
} /* GetSensorType() */

void ScanBus(void)
{
uint8_t i, y;
int iBad = 0;
char szTemp[16];

I2CInit(SDA_PIN, SCL_PIN, 100000);
scan_again:
	sharpFill(0);
    sharpWriteString(4, 12, "I2C Bus Scan", FONT_12x16, 0);
	sharpWriteBuffer();
	while (GetButtons() != 0) {
//		Delay_Ms(100);
	}
	y = 28;
	for (i=4; i<128 && iSensor == SENSOR_UNKNOWN && iBad < 10; i++) {
		digitalWrite(LED_PIN, i & 1);
	    sharpWriteString(2, y, "0x", FONT_8x8, 0);
	    i2hex(szTemp, i);
	    sharpWriteString(-1, -1, szTemp, FONT_8x8, 0);
		sharpWriteBuffer();
		if (I2CTest(i)) {
			if (i < 16) {
				iBad++; // there shouldn't be anything with an address of less than 16
				continue;
			} // bad address
		    sharpWriteString(2, y, "0x", FONT_8x8, 0);
		    i2hex(szTemp, i);
		    sharpWriteString(-1, -1, szTemp, FONT_8x8, 0);
		    sharpWriteString(-1, -1, " --> ", FONT_8x8, 0);
		    iSensor = GetSensorType(i, szTemp);
		    sharpWriteString(-1, -1, szTemp, FONT_8x8, 0);
			sharpWriteBuffer();
			y+= 8;
		}
	}
	if (iSensor == SENSOR_UNKNOWN) {
		if (iBad >= 10) {
			sharpWriteString(2, y, "bus open error", FONT_8x8, 0);
		} else {
			sharpWriteString(2, y, "No sensors found", FONT_8x8, 0);
		}
		y += 8;
		sharpWriteString(2, y, "Press button to scan again", FONT_6x8, 0);
		sharpWriteBuffer();
		while (GetButtons() == 0) {
			//Delay_Ms(25);
		}
		goto scan_again;
	}
	i = 0;
	sharpWriteString(118, 2, "Start", FONT_8x8, 0);
	sharpWriteString(110, 58, "Invert", FONT_8x8, 0);
	while (i == 0) { // wait for user to start or invert the colors
		sharpWriteBuffer();
		while (GetButtons() == 0) {
			//Delay_Ms(25);
		}
		if (GetButtons() == 1) {
			while (GetButtons() != 0) {}; // wait for the user to release the button
			i = 1; // break out of loop and start sensing
		}
		if (GetButtons() == 2) {
			bInvert = ~bInvert;
			sharpInvert();
			sharpWriteBuffer();
			while (GetButtons() != 0) {
				// wait for button release
				//Delay_Ms(25);
			}
		}
	} // while waiting for user to start
} /* ScanBus() */

void TIM2_PWMOut_Init(u16 arr, u16 psc, u16 ccp)
{
    GPIO_InitTypeDef GPIO_InitStructure={0};
    TIM_OCInitTypeDef TIM_OCInitStructure={0};
    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure={0};

    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOD , ENABLE );
    RCC_APB1PeriphClockCmd( RCC_APB1Periph_TIM2, ENABLE );

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 << (LCD_VCOM & 0xf);
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init( GPIOD, &GPIO_InitStructure );

    TIM_TimeBaseInitStructure.TIM_Period = arr;
    TIM_TimeBaseInitStructure.TIM_Prescaler = psc;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInit( TIM2, &TIM_TimeBaseInitStructure);

    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM2;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = ccp;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;
    TIM_OC2Init( TIM2, &TIM_OCInitStructure );

    TIM_CtrlPWMOutputs(TIM2, ENABLE );
    TIM_OC2PreloadConfig( TIM2, TIM_OCPreload_Disable );
    TIM_ARRPreloadConfig( TIM2, ENABLE );
    TIM_Cmd( TIM2, ENABLE );
} /* TIM2_PWMOut_Init() */

void RunLTR390(void)
{
	int i, iMax, iHead = 0;
	int iSamples[32]; // keep about 3 seconds for the max value

	memset(iSamples, 0, sizeof(iSamples));
	ltr390_init(SDA_PIN, SCL_PIN, 400000);
	ltr390_start(1); // start UV sensor
    while(1)
    {
    //	digitalWrite(LED_PIN, 1);
    	ltr390_getSample();
    	iSamples[iHead++] = _iUV;
    	iHead &= 0x1f; // circular buffer
    	Delay_Ms(50); // default sample rate = 100ms
    //	digitalWrite(LED_PIN, 0);
//    	Delay_Ms(450);
    	// find the max value of the samples collected
    	iMax = 0;
    	for (i=0; i<32; i++) {
    		if (iSamples[i] > iMax) iMax = iSamples[i];
    	}
    	ShowLTR390Sample(_iUV, iMax);
    }

} /* RunLTR390() */

void ShowCO2(void)
{
	int i, x;
	char szTemp[32];

			sharpFill(bInvert);
			sharpWriteString(132,2, "CAL", FONT_8x8, bInvert);
	        i = i2str(szTemp, (int)_iCO2);
	        sharpWriteStringCustom(&Roboto_Black_40, 0, 32, szTemp, !bInvert, 1);
	        x = sharpGetCursorX();
	        if (i < 4) {
	           sharpWriteString(x+24, 0, "  ", FONT_12x16, bInvert); // make sure old data is erased if going from 4 to 3 digits
	           sharpWriteString(x, 16, "   ", FONT_12x16, bInvert);
	        }
	        sharpWriteString(x, 2, "CO2", FONT_8x8, bInvert);
	        sharpWriteString(x, 10, "ppm", FONT_8x8, bInvert);

	        sharpWriteString(2, 36, "Temp ", FONT_12x16, bInvert);
	        i2str(szTemp, _iTemperature/10); // whole part
	        sharpWriteString(-1, 36, szTemp, FONT_12x16, bInvert);
	        i2str(szTemp, _iTemperature % 10); // fraction
	        sharpWriteString(-1, 36, ".", FONT_12x16, bInvert);
	        sharpWriteString(-1, 36, szTemp, FONT_12x16, bInvert);
	        sharpWriteString(-1, 36, "C", FONT_12x16, bInvert);

	        sharpWriteString(2, 52, "Humidity ", FONT_12x16, bInvert);
	        i2str(szTemp, _iHumidity/10); // throw away fraction since it's not accurate
	        sharpWriteString(-1, 52, szTemp, FONT_12x16, bInvert);
	        sharpWriteString(-1, 52, "%", FONT_12x16, bInvert);
	        sharpWriteBuffer();
} /* ShowCO2() */

