bitbank2/CH32V003_Sensor_Platform/User/main.c
#ifdef USE_IMU
void ShowIMU(void)
{
	int16_t acc[3];
	char szTemp[16];

	IMUGetSample(acc, NULL, NULL); // get accelerometer samples
	sharpFill(0);
	sharpWriteString(2, 4, "X: ", FONT_12x16, 0);
	i2str(szTemp, acc[0]);
	sharpWriteString(-1, -1, szTemp, FONT_12x16, 0);

	sharpWriteString(2, 24, "Y: ", FONT_12x16, 0);
	i2str(szTemp, acc[1]);
	sharpWriteString(-1, -1, szTemp, FONT_12x16, 0);

	sharpWriteString(2, 44, "Z: ", FONT_12x16, 0);
	i2str(szTemp, acc[2]);
	sharpWriteString(-1, -1, szTemp, FONT_12x16, 0);
	sharpWriteBuffer();
} /* ShowIMU() */
#endif // USE_IMU

void ShowCountdown(int iSecs)
{
	char szTemp[8];
    szTemp[0] = '0';
	szTemp[1] = (iSecs/60)+'0';
	szTemp[2] = ':';
	szTemp[3] = ((iSecs % 60) / 10) + '0';
	szTemp[4] = (iSecs % 10) + '0';
	szTemp[5] = 0;
	sharpWriteStringCustom(&Roboto_Black_40, 10, 56, szTemp, 1-bInvert, 1);
	sharpWriteBuffer();
} /* ShowCountdown() */

void CO2Calibrate(void)
{
	int i, j;

	sharpFill(bInvert);
	sharpWriteString(2,2,"Calibrating..", FONT_12x16, bInvert);
	sharpWriteBuffer();
	while (GetButtons() != 0) {};
//   scd41_start(SCD_POWERMODE_NORMAL);
   // allow 3 minutes of normal collection
   for (i=210; i>=0; i--) {
	  ShowCountdown(i);
	  j = GetButtons();
	  if (j == 3) { // user quit
		  scd41_stop();
		  return;
	  }
	  Delay_Ms(1000);
   }
   scd41_stop(); // stop periodic measurement
   i = scd41_recalibrate(423); // force recalibration
   if (i == SCD_SUCCESS)
	   sharpWriteString(2,32, "Success!", FONT_12x16, bInvert);
   else
	   sharpWriteString(2,32, "Failed", FONT_12x16, bInvert);
   sharpWriteBuffer();
//   sharpWriteString(2,56, "Press button to exit", FONT_8x8, 0);
   while (GetButtons() == 0) {
//	   Delay_Ms(20);
   }

} /* CO2Calibrate() */

void RunSCD4X(void)
{
    I2CInit(SDA_PIN, SCL_PIN, 100000);
    scd41_start(SCD_POWERMODE_NORMAL);
    while (1) {
    	if (GetButtons() == 3) {
    		CO2Calibrate();
    	}
        scd41_getSample();
        ShowCO2();
        Delay_Ms(5000); // 5 seconds per sample
    }
} /* RunSCD4X() */

#ifdef USE_RTC
void RunRTC(void)
{
	int iTick = 0;
	rtcInit((iSensor == SENSOR_DS3231) ? RTC_DS3231 : RTC_RV3032, SDA_PIN, SCL_PIN);
	rtcGetTime(&myTime);
	while (1) {
		if (GetButtons() == 1) {
			while (GetButtons() != 0) {};
			SetTime();
		} else if (GetButtons() == 2) {
			bInvert = ~bInvert;
			sharpInvert();
			sharpWriteBuffer();
			while (GetButtons() != 0) {};
		}
		Delay_Ms(33);
		if ((iTick & 0x1f) == 0) {
			ShowTime();
		}
		iTick++;
	}
} /* RunRTC() */
#endif // USE_RTC

#ifdef USE_IMU
void RunIMU(void)
{
	IMUStart(200, 0, 0); // start accelerometer at 200 samples/sec
	while (1) {
		ShowIMU(); // run as fast as possible
	}
} /* RunIMU() */
#endif

void ShowLogo(void)
{
ISBICIMG img;
int x, y, j;
uint8_t uc, *d;

	if (isbicDecodeInit(&img, (uint8_t *)psp_logo)) {
		for (y=0; y<LCD_HEIGHT; y++) {
			d = sharpGetBuffer();
			d += (y * LCD_PITCH);
			for (x=0; x<LCD_WIDTH; x+=8) {
				for (j=0; j<8; j++) {
					uc <<= 1;
					if (!isbicDecode1Pixel(&img)) {
						uc |= 1;
					}
				} // for j
				*d++ = uc;
			} // for x
		} // for y
	}
} /* ShowLogo() */

int main(void)
{
	int i;
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    Delay_Init();
//    Delay_Ms(2000);
    TIM2_PWMOut_Init( 20, 65535, 10 ); // start a 50% duty cycle PWM output on D3 of about 4hz
    pinMode(BUTTON0_PIN, INPUT_PULLUP);
    pinMode(BUTTON1_PIN, INPUT_PULLUP);
    sharpInit(8000000, LCD_CS);
    sharpFill(0);
    sharpWriteBuffer();
    ShowLogo(); // decode the logo image
    sharpWriteBuffer();
//    Delay_Ms(3000);
//    sharpFill(0);
//    sharpWriteString(32, 2, "CH32V003", FONT_12x16, 0);
//    sharpWriteString(44, 18, "Sensor", FONT_12x16, 0);
//    sharpWriteString(32, 34, "Platform", FONT_12x16, 0);
//    sharpWriteString(28, 50, "by Larry Bank", FONT_8x8, 0);
//    sharpWriteString(2, 58,"Press buttons 1+2 to start", FONT_6x8, 0);
//    sharpWriteBuffer();
//    pinMode(LCD_VCOM, OUTPUT);
    pinMode(LED_PIN, OUTPUT);
    i = 0;
    while (GetButtons() == 0) {
    	digitalWrite(LED_PIN, i & 1);
    	Delay_Ms(250);
    	i++;
    }
    digitalWrite(LED_PIN, 0);
    while (GetButtons() != 0) {
    	//Delay_Ms(100);
    }
#ifdef USE_GPS
    USARTInit(9600);
    RunGPS();
#endif // USE_GPS
    ScanBus(); // if we return from here, we have a recognized sensor
    digitalWrite(LED_PIN, 0);
    switch (iSensor) { // start displaying sensor data
#ifdef USE_IMU
    	case SENSOR_LSM6DS3:
    		RunIMU();
    		break;
#endif // USE_IMU
#ifdef USE_RTC
    	case SENSOR_DS3231:
    	case SENSOR_RV3032:
    		RunRTC();
    		break;
#endif // USE_RTC
    	case SENSOR_LTR390:
    		RunLTR390();
    		break;
    	case SENSOR_SCD4X:
    		RunSCD4X();
    		break;
    }
} /* main() */
